const sampleData = {
  products: [
    {
      name: "Акумуляторна викрутка MAKITA DF001DW",
      slug: "Акумуляторна-викрутка-MAKITA-DF001DW",
      category: "Aкумуляторні шуруповерти",
      description:
        "Акумуляторна викрутка Makita DF001DW — це універсальний та зручний інструмент, розроблений для швидкого та ефективного загвинчування та відгвинчування кріплень. Ця модель є ідеальним рішенням для збирання меблів, ремонту дрібної побутової техніки, електроніки та виконання інших повсякденних завдань, де не потрібна велика потужність. Завдяки компактній конструкції та акумуляторному живленню, вона забезпечує максимальну зручність і мобільність.",
      images: [
        "/images/sample-products/p1-1.jpg",
        "/images/sample-products/p1-2.jpg",
      ],
      oldPrice: 69.99,
      price: 59.99,
      brand: "Makita",
      rating: 4.5,
      numReviews: 10,
      stock: 5,
      isFeatured: true,
      banner: "banner-1.jpg",
    },
    {
      name: "Дриль-шурупокрут безударна MAKITA DF0300",
      slug: "Дриль-шурупокрут-безударна-MAKITA-DF0300",
      category: "Мережеві шуруповерти",
      description:
        "Вибір якісного електроінструменту - це запорука успішного виконання ремонтних і будівельних робіт. Однією з найбільш популярних моделей на ринку є дриль-шуруповерт Makita DF0300. Цей інструмент ідеально підходить для домашнього та професійного використання, поєднуючи в собі зручність, надійність і високу продуктивність.",
      images: [
        "/images/sample-products/p2-1.jpg",
        "/images/sample-products/p2-2.jpg",
      ],
      price: 85.9,
      brand: "Makita",
      rating: 4.2,
      numReviews: 8,
      stock: 10,
      isFeatured: true,
      banner: "banner-2.jpg",
    },
    {
      name: "Акумуляторний ударний шурупокрут (імпакт) Makita LXT DTD172RTJ",
      slug: "Акумуляторний-ударний-шурупокрут-(імпакт)-Makita-LXT-DTD172RTJ",
      category: "Ударні шуруповерти",
      description:
        "Акумуляторний ударний гайкокрут Makita DTD172RTJ - інструмент професійної серії для роботи  в умовах постійного навантаження, укомлектований зараядним пристроєм та акумуляторами на 5Аг",
      images: [
        "/images/sample-products/p3-1.jpg",
        "/images/sample-products/p3-2.jpg",
      ],
      price: 99.95,
      brand: "Makita",
      rating: 4.9,
      numReviews: 3,
      stock: 0,
      isFeatured: false,
      banner: null,
    },
    {
      name: "Акумуляторний дриль-шурупокрут MAKITA CXT DF332DWYE",
      slug: "Акумуляторний-дриль-шурупокрут-MAKITA-CXT-DF332DWYE",
      category: "Шуруповерти 12 В",
      description:
        "Акумуляторний дриль-шурупокрут Makita DF332DWYE є компактним та продуктивним інструментом, розробленим для широкого спектра робіт, від складання меблів до монтажних операцій. Завдяки безщітковому двигуну та живленню від платформи CXT 12 В, він поєднує високу потужність із винятковою мобільністю, що робить його незамінним помічником як для професіоналів, так і для домашніх майстрів.",
      images: [
        "/images/sample-products/p4-1.jpg",
        "/images/sample-products/p4-2.jpg",
      ],
      price: 39.95,
      brand: "Makita",
      rating: 3.6,
      numReviews: 5,
      stock: 10,
      isFeatured: false,
      banner: null,
    },
    {
      name: "Акумуляторна кутова дриль Makita LXT DDA450ZK",
      slug: "Акумуляторна-кутова-дриль-Makita-LXT-DDA450ZK",
      category: "Шуруповерти 18 В",
      description:
        "Акумуляторний кутовий дриль Makita LXT DDA450ZK (каркас) — це спеціалізований інструмент професійної серії LXT 18 В, розроблений для ефективного свердління у обмеженому просторі. Завдяки компактній кутовій конструкції та безщітковому двигуну, цей дриль забезпечує високу продуктивність та точність там, де звичайні дрилі не можуть дістатися.",
      images: [
        "/images/sample-products/p5-1.jpg",
        "/images/sample-products/p5-2.jpg",
      ],
      price: 79.99,
      brand: "Makita",
      rating: 4.7,
      numReviews: 18,
      stock: 6,
      isFeatured: false,
      banner: null,
    },
    {
      name: "Акумуляторний ударний гайкокрут MAKITA XGT TW010GZ",
      slug: "Акумуляторний-ударний-гайкокрут-MAKITA-XGT-TW010GZ",
      category: "Імпакти",
      description:
        "Акумуляторний ударний гайкокрут MAKITA XGT TW010GZ є інструментом, призначеним для роботи з великими і тугими болтами. Завдяки живленню від акумуляторної системи MAKITA XGT 40В, він забезпечує високий крутний момент, необхідний для виконання найскладніших завдань у будівництві, промисловості та обслуговуванні важкої техніки. Безщітковий двигун підвищує продуктивність інструмента та продовжує термін його служби. Наявність декількох режимів потужності дозволяє адаптувати гайкокрут до різних типів робіт, забезпечуючи точний контроль.",
      images: [
        "/images/sample-products/p6-1.jpg",
        "/images/sample-products/p6-2.jpg",
      ],
      price: 99.99,
      brand: "Makita",
      rating: 4.6,
      numReviews: 12,
      stock: 8,
      isFeatured: true,
      banner: null,
    },
  ],
};

export default sampleData;
